In [1]:
import pandas as pd
df=pd.read_csv('Stores1b.csv')
df.head()

,Branch,City,Customer,Gender,Product line,Unit_price,Quantity,Tax,Total,Payment,cogs,Rating,Age,Quarterly_Tax,Price
0,A,Yangon,Member,Female,Health and beauty,74.69,7,26.1415,548.9715,Ewallet,522.83,9.1,23,210.0,7469
1,C,Naypyitaw,Normal,Female,Electronic accessories,15.28,5,3.8200,80.2200,Cash,76.40,9.6,23,210.0,1528
2,A,Yangon,Normal,Male,Home and lifestyle,46.33,7,16.2155,340.5255,Credit card,324.31,7.4,24,NaN,4633
3,A,Yangon,Member,Male,Health and beauty,58.22,8,23.2880,489.0480,Ewallet,465.76,8.4,26,210.0,5822
4,A,Yangon,Normal,Male,Sports and travel,86.31,60,30.2085,634.3785,Ewallet,604.17,5.3,30,210.0,8631

In [2]:

df=pd.get_dummies(df,drop_first=True)
df.head()

,Unit_price,Quantity,Tax,Total,cogs,Rating,Age,Quarterly_Tax,Price,Branch_B,...,City_Yangon,Customer_Normal,Gender_Male,Product line_Fashion accessories,Product line_Food and beverages,Product line_Health and beauty,Product line_Home and lifestyle,Product line_Sports and travel,Payment_Credit card,Payment_Ewallet
0,74.69,7,26.1415,548.9715,522.83,9.1,23,210.0,7469,False,...,True,False,False,False,False,True,False,False,False,True
1,15.28,5,3.8200,80.2200,76.40,9.6,23,210.0,1528,False,...,False,True,False,False,False,False,False,False,False,False
2,46.33,7,16.2155,340.5255,324.31,7.4,24,NaN,4633,False,...,True,True,True,False,False,False,True,False,True,False
3,58.22,8,23.2880,489.0480,465.76,8.4,26,210.0,5822,False,...,True,False,True,False,False,True,False,False,False,True
4,86.31,60,30.2085,634.3785,604.17,5.3,30,210.0,8631,False,...,True,True,True,False,False,False,False,True,False,True

In [3]:
#rows and Columns
df.shape

(51, 22)

In [4]:
#Categorical and numerical columns
cat=df.select_dtypes(include='object').columns
num=df.select_dtypes(include='number').columns
print(cat)
print(f"length:{len(cat)}")
print(num)
print(f"length:{len(num)}")

Index([], dtype='object')
length:0
Index(['Unit_price', 'Quantity', 'Tax', 'Total', 'cogs', 'Rating', 'Age',
       'Quarterly_Tax', 'Price'],
      dtype='object')
length:9

In [5]:
#Display the columns with null values
null=df.columns[df.isnull().any()]
print(null.tolist())

['Quarterly_Tax']

In [6]:
#Display the min,max and mode in numerical columns
num=df.select_dtypes(include='number').columns
for col in num:
    print(col)
    print(f"{df[col].min()}")
    print(f"Max:{df[col].max()}")
    print(f"Mode:{df[col].mode()[0]}")

Unit_price
14.48
Max:99.42
Mode:18.93
Quantity
1
Max:60
Mode:2
Tax
1.537
Max:39.48
Mode:5.679
Total
32.277
Max:829.08
Mode:119.259
cogs
30.74
Max:789.6
Mode:113.58
Rating
4.1
Max:9.9
Mode:4.5
Age
22
Max:32
Mode:22
Quarterly_Tax
19.0
Max:234.0
Mode:85.0
Price
1448
Max:9942
Mode:1893

In [ ]:
#Five number summary
import matplotlib.pyplot as plt
num=df.select_dtypes(include='number').columns
five=df[num].describe().T[['min','25%','50%','75%','max']]
print(five)

                    min         25%        50%       75%      max
Unit_price       14.480    38.28000    62.6200    85.715    99.42
Quantity          1.000     3.50000     6.0000     8.000    60.00
Tax               1.537     6.93975    16.2155    23.829    39.48
Total            32.277   145.73475   340.5255   500.409   829.08
cogs             30.740   138.79500   324.3100   476.580   789.60
Rating            4.100     5.10000     7.0000     8.050     9.90
Age              22.000    23.00000    27.0000    29.000    32.00
Quarterly_Tax    19.000    85.00000    85.0000   210.000   234.00
Price          1448.000  3828.00000  6262.0000  8571.500  9942.00